app/Controllers/CustomerAccounts.php

SELECT *
FROM `customers`
---
    public function index()
    {
        $customerModel = new CustomerModel();

        $data['customers'] = $customerModel->findAll();

SELECT *
FROM `customers`
WHERE `customers`.`id` = '1'
---
    public function edit($id)
    {
        $customerModel = new CustomerModel();

        $data['customer'] = $customerModel->find($id);