app/Controllers/UserAccounts.php

    public function index()
    {
        $userModel = new UserModel();

        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`

    public function edit($id)
    {
        $userModel = new UserModel();

        $data['user'] = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'